<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Идентификатор системы в таблице пользователей
    |--------------------------------------------------------------------------
    |
    | id системы в таблице пользователей. По этому идентификатору выбирается
    | кошелек системы и производится расчет по платежам с системой.
    |
    */

    'system_id' => 1,

    /*
    |--------------------------------------------------------------------------
    | Типы платежей
    |--------------------------------------------------------------------------
    |
    |
    */

    'type' =>
    [
        'manual'               => 'manual introduction means',     // ручное занесение средств на кошелек
        'operatorPayment'      => 'payment of the operator',       // плата оператору за обработку лида
        'openLead'             => 'open the Lead',                 // плата за открытие лида
        'closingDeal'          => 'closing the deal',              // плата за закрытие сделки по лиду
        'repaymentForLead '    => 'repayment for the bad lead',    // возврат средств за bad_lead агентам которые его купили
        'operatorRepayment'    => 'refund for operator handling',  // "штраф" за оператора автору "плохого" лида
        'rewardForOpenLead'    => 'Agent reward for the Lead',     // "награждение" агента за открытие лида
        'closingDealInGroup'   => 'Closing deal in group',         // закрытие сделок в группе
    ],


];